// © Copyright 2004-2008, 2015-2016 HP Development Company, L.P.

HSDTaskName = "Tiedoston lataus";
kUploadingTitleStringKey = "Ladataan…";
kUploadingReceiveResponseTitleStringKey = "Vastaanotetaan vastausta…";

// Errors
kFileOpenError = "Tiedoston %@ avaus ei onnistu.";
kFileOpenErrorExplanation = "Tämä tiedosto on vahingoittunut, siirretty toiseen paikkaan, nimetty uudelleen tai poistettu. Tarkista tiedoston sijainti tai valitse jokin toinen tiedosto ja yritä uudelleen.";
kPrintChannelOpenError = "Tulostinkanavan avaus ei onnistu.";
kPrintChannelOpenErrorExplanation = "Varmista, että tulostin on liitetty ja kytketty toimimaan. Yritä sitten uudelleen.";
kSendDataError = "Tietojen lähetys tulostimelle ei onnistu.";
kSendDataErrorExplanation = "Varmista, että tulostin on liitetty ja kytketty toimimaan. Yritä sitten uudelleen.";

HSDDescriptionField = "Valitse tiedosto ja siirrä se tulostimeesi. Toiminnon tulos määräytyy siirtämäsi tiedoston sisällön mukaan.";
HSDFilePathLabel = "Tiedostonimi:";
HSDFilePathField = "<Ei valittu>";
HSDChooseButton = "Valitse…";
HSDGetResponseButton = "Näytä laitteen vastaus";
HSDUploadButton = "Lataa";

HSDProgressTitle = "Ladataan…";
HSDCancelButton = "Peruuta";

HSDCloseButton = "Sulje";
